<template>
  <div class="About">
    <page-header
      :title="$t('数値の入力ミスに関するお知らせ(2021年7月21日発表)')"
    />
    <static-card>
      {{ $t('当サイトを閲覧していただきありがとうございます。') }}<br />
      <br />
      {{
        $t(
          '今回、一部グラフにて表示されている数値において入力ミスがありましたのでご報告させていただきます。下記の内容は、既に修正済みです。'
        )
      }}<br />
      <br />
      {{ $t('1. 入力ミスのあったグラフ及び数値') }}<br />
      <br />
      {{ $t('報告日別による陽性者数の推移：') }}<br />
      <ul>
        <li>
          {{
            $t(
              '2021年7月1日において12名と相模原市から発表されていた数値を当サイトにて7名として表記。'
            )
          }}
        </li>
      </ul>
      <br />
      <br />
      {{ $t('新規陽性者数：') }}<br />
      <ul>
        <li>
          {{
            $t(
              '2021年5月15日の陽性者数において15名と相模原市から発表されていた数値を当サイトにて12名として表記。それにともない7日間平均の数値も改めました。(2021年5月15日～2021年5月21日分まで)'
            )
          }}
        </li>
        <br />
        <li>
          {{
            $t(
              '2021年6月28日の陽性者数において10名と相模原市から発表されていた数値を当サイトにて20名として表記。それにともない7日間平均の数値も改めました。(2021年6月28日～2021年7月4日分まで)'
            )
          }}
        </li>
      </ul>
      <br />
      <br />
      {{ $t('確定日別による陽性者数の推移：') }}<br />
      <ul>
        <li>
          {{
            $t(
              '2021年4月12日の陽性判明者数において4名と相模原市から発表されていた数値を当サイトにて5名として表記。'
            )
          }}
        </li>
        <br />
        <li>
          {{
            $t(
              '2021年4月17日の陽性判明者数において12名と相模原市から発表されていた数値を当サイトにて18名として表記。'
            )
          }}
        </li>
        <br />
        <li>
          {{
            $t(
              '2021年5月11日の陽性判明者数において35名と相模原市から発表されていた数値を当サイトにて34名として表記。'
            )
          }}
        </li>
        <br />
        <li>
          {{
            $t(
              '2021年7月13日の陽性判明者数において42名と相模原市から発表されていた数値を当サイトにて44名として表記。(この数値は、2021年7月21日現在のものでありグラフ上の数値と異なる場合があります)'
            )
          }}
        </li>
      </ul>
      <br />
      <br />
      {{ $t('2. 対応策') }}<br />
      <br />{{ $t('i. 数値入力時の二重チェックを必ず行います。') }}<br />
      <br />{{
        $t(
          '当サイトは、一人で運営しているため忙しい際の確認が愚かなことがありました。今後、入力ミスのないよう二重チェックを必ず行います。'
        )
      }}<br />
      <br />
      {{ $t('ii. 皆様からの数値入力ミスの報告を受け付けます。') }}<br />
      <br />
      {{
        $t(
          '下記リンクより数値入力ミスの報告を受け付けます。このフォームを作ることにより運営者が気付かなかったミスをすぐに修正できるようになると考えております。'
        )
      }}<br />
      <br />
      <app-link to="https://forms.gle/YoPFs1u8h9dScUjZ9" :icon-size="12"
        >{{
          $t('数値入力ミスに関する報告フォーム(外部サービスを使用しています)')
        }}
      </app-link>
      <br />
      <br />
      {{
        $t(
          '数値入力ミスを発見した場合、上記リンクよりご報告ください。入力ミスであることが運営者にて確認でき次第修正します。修正時には、このページにて数値の修正についてお知らせします。その際に、報告者の方のお名前を報告していただいた方として掲載させていただくことを考えております。お名前の掲載をご希望の場合、上記リンク内フォームの最後にお名前(ニックネーム・イニシャル可)を記載してから送信してください。'
        )
      }}<br />
      <br />
      <br />
      {{
        $t(
          '今後、このようなことのないように注意して運営させていただきます。 - 相模原市 新型コロナウイルス感染症対策サイト 運営者'
        )
      }}
    </static-card>
  </div>
</template>

<script lang="ts">
import Vue from 'vue'
import { MetaInfo } from 'vue-meta'

import AppLink from '@/components/_shared/AppLink.vue'
import PageHeader from '@/components/_shared/PageHeader.vue'
import StaticCard from '@/components/_shared/StaticCard.vue'

export default Vue.extend({
  components: {
    PageHeader,
    StaticCard,
    AppLink,
  },
  head(): MetaInfo {
    return {
      title: this.$t(
        '数値の入力ミスに関するお知らせ (2021年7月21日発表)'
      ) as string,
    }
  },
  methods: {
    formatDate(date) {
      return `${this.$d(date, 'date')}`
    },
  },
})
</script>
